КР3/src/Catalogs/ЖеребьевкаКоманд/ЖеребьевкаКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖеребьевкаКоманд</name>
  <predefined>
    <items>
      <name>Приложение61</name>
      <description>Приложение 6.1</description>
    </items>
    <items>
      <name>Приложение62</name>
      <description>Приложение 6.2</description>
    </items>
    <items>
      <name>Приложение64</name>
      <description>Приложение 6.4</description>
    </items>
    <items>
      <name>Приложение65</name>
      <description>Приложение 6.5</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоПобед</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокВстреч</name>
    <attributes>
      <name>ВариантABC</name>
      <type>
        <types>EnumRef.ВариантыРасстановки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантXYZ</name>
      <type>
        <types>EnumRef.ВариантыРасстановки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КР3/src/Enums/ВариантыРасстановки/ВариантыРасстановки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасстановки</name>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>B</name>
  </enumValues>
  <enumValues>
    <name>C</name>
  </enumValues>
  <enumValues>
    <name>D</name>
  </enumValues>
  <enumValues>
    <name>E</name>
  </enumValues>
  <enumValues>
    <name>F</name>
  </enumValues>
  <enumValues>
    <name>X</name>
  </enumValues>
  <enumValues>
    <name>Y</name>
  </enumValues>
  <enumValues>
    <name>Z</name>
  </enumValues>
  <enumValues>
    <name>W</name>
  </enumValues>
  <enumValues>
    <name>V</name>
  </enumValues>
  <enumValues>
    <name>U</name>
  </enumValues>
  <enumValues>
    <name>Пара</name>
  </enumValues>
</mdclass:Enum>

КР3/src/Catalogs/ЖеребьевкаКоманд/ManagerModule.bsl
//процедура заполняет или перезаполняет все шаблоны
Процедура ЗаполнитьШаблоныЖеребьевок() Экспорт
	
	ВР = Перечисления.ВариантыРасстановки;
	
	//Приложение 6.1
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение61.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.1";
	ОбъектПриложения.КоличествоПобед = 3;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ОбъектПриложения.Записать();
	
	//Приложение 6.2
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение62.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.2";
	ОбъектПриложения.КоличествоПобед = 3;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.Пара,ВР.Пара);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ОбъектПриложения.Записать();
	
	//Приложение 6.4
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение64.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.4";
	ОбъектПриложения.КоличествоПобед = 4;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.Пара,ВР.Пара);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Z);
	ОбъектПриложения.Записать();
	
	//Приложение 6.5
	ОбъектПриложения = Справочники.ЖеребьевкаКоманд.Приложение65.ПолучитьОбъект();
	ОбъектПриложения.Наименование = "Приложение 6.5";
	ОбъектПриложения.КоличествоПобед = 5;
	ОбъектПриложения.ПорядокВстреч.Очистить();
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Y);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Z);
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.Y);
	
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.B,ВР.Z);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.C,ВР.X);
	ДобавитьСтрокуПорядкаВстреч(ОбъектПриложения.ПорядокВстреч,ВР.A,ВР.Y);
	ОбъектПриложения.Записать();
	
КонецПроцедуры
 
Процедура ДобавитьСтрокуПорядкаВстреч(Таблица,ABC,XYZ)
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ВариантABC = ABC;
	НовСтрока.ВариантXYZ = XYZ;
	
КонецПроцедуры
